In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sb

C:\Users\Chirag M. Sidhdhapur\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\Chirag M. Sidhdhapur\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\Chirag M. Sidhdhapur\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\Chirag M. Sidhdhapur\Anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [11]:
dict={"Animal":['cat','Dog','Moose','Dog','Moose'],"Age":[4.0,17.0,6.0,8.0,4.0],"Worth":[72000.0,48000.0,54000.0,61000.0,None]
     ,"Friendly":['No','Yes','No','No','Yes']}

In [12]:
df=pd.DataFrame(dict)

In [13]:
df

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   6.0  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      NaN      Yes

In [33]:
x=df.iloc[:,:3].values

In [34]:
x

array([['cat', 4.0, 72000.0],
       ['Dog', 17.0, 48000.0],
       ['Moose', 6.0, 54000.0],
       ['Dog', 8.0, 61000.0],
       ['Moose', 4.0, nan]], dtype=object)

In [46]:
y=df.iloc[:,3].values

In [47]:
y

array(['No', 'Yes', 'No', 'No', 'Yes'], dtype=object)

In [48]:
from sklearn.preprocessing import Imputer

In [49]:
imputer=Imputer(missing_values=np.nan,axis=1)

In [50]:
imputer=imputer.fit(x[:,1:3])

In [51]:
x[:,1:3]=imputer.transform(x[:,1:3])

In [52]:
x

array([['cat', 4.0, 72000.0],
       ['Dog', 17.0, 48000.0],
       ['Moose', 6.0, 54000.0],
       ['Dog', 8.0, 61000.0],
       ['Moose', 4.0, 58750.0]], dtype=object)

In [55]:
from sklearn.preprocessing import LabelEncoder

In [57]:
x[:,0]=LabelEncoder().fit_transform(x[:,0])

In [59]:
df_x=pd.DataFrame(x)

In [61]:
df_x

   0   1      2
0  2   4  72000
1  0  17  48000
2  1   6  54000
3  0   8  61000
4  1   4  58750

In [62]:
from sklearn.preprocessing import OneHotEncoder

In [64]:
x

<5x5 sparse matrix of type '<class 'numpy.float64'>'
	with 15 stored elements in COOrdinate format>

In [70]:
df

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   6.0  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      NaN      Yes

In [71]:
dict={"Animal":['cat','Dog','Moose','Dog','Moose'],"Age":[4.0,17.0,None,8.0,4.0],"Worth":[72000.0,48000.0,54000.0,61000.0,None]
     ,"Friendly":['No','Yes','No','No','Yes']}

In [73]:
dataframe=pd.DataFrame(dict)

In [74]:
dataframe

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   NaN  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      NaN      Yes

In [75]:
data=dataframe
data

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   NaN  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      NaN      Yes

In [76]:
data.isnull()

   Animal    Age  Worth  Friendly
0   False  False  False     False
1   False  False  False     False
2   False   True  False     False
3   False  False  False     False
4   False  False   True     False

In [78]:
data.Age.isnull()

0    False
1    False
2     True
3    False
4    False
Name: Age, dtype: bool

In [81]:
data[data['Age'].isnull()]

  Animal  Age    Worth Friendly
2  Moose  NaN  54000.0       No

In [93]:
data.isna().sum()

Animal      0
Age         1
Worth       1
Friendly    0
dtype: int64

In [96]:
data.Animal.unique()

array(['cat', 'Dog', 'Moose'], dtype=object)

In [97]:
data.Animal.value_counts()

Moose    2
Dog      2
cat      1
Name: Animal, dtype: int64

In [98]:
data.fillna(0)

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   0.0  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      0.0      Yes

In [101]:
data.fillna(method='Backfill')

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose   8.0  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0      NaN      Yes

In [102]:
data.fillna(method='ffill')

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
2  Moose  17.0  54000.0       No
3    Dog   8.0  61000.0       No
4  Moose   4.0  61000.0      Yes

In [103]:
data.dropna()

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1    Dog  17.0  48000.0      Yes
3    Dog   8.0  61000.0       No

In [104]:
data.dropna(axis=1)

  Animal Friendly
0    cat       No
1    Dog      Yes
2  Moose       No
3    Dog       No
4  Moose      Yes

In [110]:
data.replace({None:0,'Dog':'Kutta'})

  Animal   Age    Worth Friendly
0    cat   4.0  72000.0       No
1  Kutta  17.0  48000.0      Yes
2  Moose   0.0  54000.0       No
3  Kutta   8.0  61000.0       No
4  Moose   4.0      0.0      Yes

In [111]:
data.Animal.value_counts()

Moose    2
Dog      2
cat      1
Name: Animal, dtype: int64

In [112]:
from sklearn.preprocessing import Imputer

In [122]:
d=data.values

In [130]:
imputer=Imputer(missing_values='NaN',axis=1)
imputer=imputer.fit(d[:,1:3])
d[:,1:3]=imputer.transform(d[:,1:3])

In [131]:
data=pd.DataFrame(d)

In [132]:
data

       0      1      2    3
0    cat      4  72000   No
1    Dog     17  48000  Yes
2  Moose  54000  54000   No
3    Dog      8  61000   No
4  Moose      4      4  Yes

In [133]:
data

       0      1      2    3
0    cat      4  72000   No
1    Dog     17  48000  Yes
2  Moose  54000  54000   No
3    Dog      8  61000   No
4  Moose      4      4  Yes